; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	infrared1 - mode
	image0 - mode
	GroundStation1 - direction
	GroundStation0 - direction
	Star3 - direction
	Star2 - direction
	Star4 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star2)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 image0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
	(supports instrument3 image0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star3)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(supports instrument5 infrared1)
	(supports instrument5 image0)
	(calibration_target instrument5 Star3)
	(supports instrument6 image0)
	(supports instrument6 infrared1)
	(calibration_target instrument6 Star3)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet12)
	(supports instrument7 image0)
	(calibration_target instrument7 Star2)
	(supports instrument8 image0)
	(supports instrument8 infrared1)
	(calibration_target instrument8 Star4)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star10)
)
(:goal (and
	(pointing satellite0 Star10)
	(have_image Star5 image0)
	(have_image Star6 infrared1)
	(have_image Star7 image0)
	(have_image Phenomenon8 infrared1)
	(have_image Planet9 image0)
	(have_image Star10 image0)
	(have_image Planet11 image0)
	(have_image Planet12 infrared1)
	(have_image Planet13 infrared1)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 10
2. (calibrate satellite1 instrument3 star3)
   added: (calibrated instrument3)
   goals met: 0 of 10
3. (turn_to satellite1 planet9 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet9)
   goals met: 0 of 10
4. (take_image satellite1 planet9 instrument3 image0)
   added: (have_image planet9 image0)
   goals met: 1 of 10
5. (turn_to satellite1 planet13 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 planet13)
   goals met: 1 of 10
6. (take_image satellite1 planet13 instrument3 infrared1)
   added: (have_image planet13 infrared1)
   goals met: 2 of 10
7. (turn_to satellite1 planet12 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet12)
   goals met: 2 of 10
8. (take_image satellite1 planet12 instrument3 infrared1)
   added: (have_image planet12 infrared1)
   goals met: 3 of 10
9. (turn_to satellite1 planet11 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet11)
   goals met: 3 of 10
10. (take_image satellite1 planet11 instrument3 image0)
   added: (have_image planet11 image0)
   goals met: 4 of 10
11. (turn_to satellite1 phenomenon8 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon8)
   goals met: 4 of 10
12. (take_image satellite1 phenomenon8 instrument3 infrared1)
   added: (have_image phenomenon8 infrared1)
   goals met: 5 of 10
13. (turn_to satellite0 star10 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star10)
   goals met: 6 of 10
14. (turn_to satellite1 star10 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star10)
   goals met: 6 of 10
15. (take_image satellite1 star10 instrument3 image0)
   added: (have_image star10 image0)
   goals met: 7 of 10
16. (turn_to satellite1 star5 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star5)
   goals met: 7 of 10
17. (take_image satellite1 star5 instrument3 image0)
   added: (have_image star5 image0)
   goals met: 8 of 10
18. (turn_to satellite1 star6 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star6)
   goals met: 8 of 10
19. (take_image satellite1 star6 instrument3 infrared1)
   added: (have_image star6 infrared1)
   goals met: 9 of 10
20. (turn_to satellite1 star7 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star7)
   goals met: 9 of 10
21. (take_image satellite1 star7 instrument3 image0)
   added: (have_image star7 image0)
   goals met: 10 of 10
